#pragma once

/* ==== STRUCTS ===================*/

struct RefdefView {
    Vector2 tanHalfFov;		// 0x00
    uint8_t unk1[0xC];		// 0x08
    Vector3 axis[3];      // 0x14
};

struct refdef_t {
    int x;           // 0x00
    int y;           // 0x04
    int width;       // 0x08
    int height;      // 0x0C
    RefdefView view; // 0x10

    bool operator==(const refdef_t& v)
    {
        if (x == v.x && y == v.y && width == v.width && height == v.height && view.axis->x == v.view.axis->x && view.axis->y == v.view.axis->y && view.axis->z == v.view.axis->z && view.tanHalfFov.x == v.view.tanHalfFov.x && view.tanHalfFov.y == v.view.tanHalfFov.y && view.unk1 == v.view.unk1) {
            return true;
        }
        else {
            return false;
        }
    }
};

struct refdefKeyStruct
{
    DWORD ref0; // 0x00
    DWORD ref1; // 0x04
    DWORD ref2; // 0x08
};

struct NameEntry {
    uint32_t idx;
    char name[0x24];
    uint8_t unk1[0x64];
    uint32_t health;
};
/* =================================*/

bool is_bad_ptr(void* adr) { return adr == nullptr; }
bool IsValidPointer(void* addr) { return !is_bad_ptr(addr); }
namespace utils
{
    void log(const char* str)
    {
        std::cout << str << std::endl;
    }
}

namespace offsets
{
    constexpr auto Camera_Base = 0x157F5CD0;
    constexpr auto Camera_Pos = 0x1D8;
    constexpr auto Local_Index = 0x34D20;
    constexpr auto CLIENT_INFO = 0x1806E058;
    constexpr auto CLIENT_BASE = 0x9FDE8;
    constexpr auto Ref_Def = 0x18070A08;
    constexpr auto Dead_1 = 0x66C;
    constexpr auto Dead_2 = 0x5C8;
    constexpr auto Player_Pos_Info = 0x4F8;
    constexpr auto Player_Size = 0x3AB8;
    constexpr auto Player_Team = 0x3F0;
    constexpr auto Player_Valid = 0x544;
    constexpr auto Name_Array = 0x1807C248;
